examples/thermoregulation/makehuman/openfoam_cube_case/0/U
FoamFile
{
    format ascii;
    class volVectorField;
    location "0";
    object U;
}

dimensions [0 1 -1 0 0 0 0];

internalField uniform (0 0 0);

boundaryField
{
    inlet { type fixedValue; value uniform (0 0 0); }
    outlet { type zeroGradient; }
    floor { type noSlip; }
    ceiling { type noSlip; }
    sideA { type noSlip; }
    sideB { type noSlip; }
    human { type noSlip; }
}
