examples/thermoregulation/makehuman/openfoam_cube_case/0/k
FoamFile
{
    format ascii;
    class volScalarField;
    location "0";
    object k;
}

dimensions [0 2 -2 0 0 0 0];

internalField uniform 1e-6;

boundaryField
{
    inlet { type zeroGradient; }
    outlet { type zeroGradient; }
    floor { type zeroGradient; }
    ceiling { type zeroGradient; }
    sideA { type zeroGradient; }
    sideB { type zeroGradient; }
    human { type zeroGradient; }
}
