examples/thermoregulation/makehuman/openfoam_cube_case/0/nut
FoamFile
{
    format ascii;
    class volScalarField;
    location "0";
    object nut;
}

dimensions [0 2 -1 0 0 0 0];

internalField uniform 0;

boundaryField
{
    inlet { type zeroGradient; }
    outlet { type zeroGradient; }
    floor { type zeroGradient; }
    ceiling { type zeroGradient; }
    sideA { type zeroGradient; }
    sideB { type zeroGradient; }
    human { type zeroGradient; }
}
