examples/thermoregulation/makehuman/openfoam_cube_case/0/omega
FoamFile
{
    format ascii;
    class volScalarField;
    location "0";
    object omega;
}

dimensions [0 0 -1 0 0 0 0];

internalField uniform 1;

boundaryField
{
    inlet { type zeroGradient; }
    outlet { type zeroGradient; }
    floor { type zeroGradient; }
    ceiling { type zeroGradient; }
    sideA { type zeroGradient; }
    sideB { type zeroGradient; }
    human { type zeroGradient; }
}
